#использовать "../src"
#Использовать asserts
#Использовать logos

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ПроверитьПростыеТипы");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьСпециальныеТипы");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьМассивы");
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьМассивы");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьТаблицаЗначений");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьДеревоЗначений");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьСписокЗначений");

	ИменаТестов.Добавить("ТестДолжен_ПроверитьСтруктуры");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьСоответствия");
	
	Возврат ИменаТестов;

КонецФункции

#Область Реализованные_тесты

Процедура ТестДолжен_ПроверитьПростыеТипы() Экспорт

	ЗначениеЧисло = 0;
	ЗначениеСтрока = "Строка";
	ЗначениеБулево = Истина;
	ЗначениеДата = Дата("20190101");
	ЗначениеТип = Тип("Строка");	

	Ожидаем.Что(ПроверкаТипа.ЭтоЧисло(ЗначениеЧисло), "Проверка типа число должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСтрока(ЗначениеСтрока), "Проверка типа строка должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоБулево(ЗначениеБулево), "Проверка типа булево должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоДата(ЗначениеДата), "Проверка типа дата должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоТип(ЗначениеТип), "Проверка типа тип должна быть успешной").ЕстьИстина();
		
	Ожидаем.Что(ПроверкаТипа.ЭтоПростойТип(ЗначениеЧисло), "Проверка простого типа число должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоПростойТип(ЗначениеСтрока), "Проверка простого типа строка должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоПростойТип(ЗначениеБулево), "Проверка простого типа булево должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоПростойТип(ЗначениеДата), "Проверка простого типа дата должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоПростойТип(ЗначениеТип), "Проверка простого типа тип должна быть успешной").ЕстьЛожь();
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьСпециальныеТипы() Экспорт

	ЗначениеНеопределено = Неопределено;
	ЗначениеUID = Новый УникальныйИдентификатор();
	ЗначениеСценарий = ЭтотОбъект;
	
	Ожидаем.Что(ПроверкаТипа.ЭтоНеопределено(ЗначениеНеопределено), "Проверка типа <Неопределено> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоUID(ЗначениеUID), "Проверка типа <UID> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСценарий(ЗначениеСценарий), "Проверка типа <Сценарий> должна быть успешной").ЕстьИстина();

КонецПроцедуры

Процедура ТестДолжен_ПроверитьМассивы() Экспорт

	ЗначениеМассив = Новый Массив();
	ЗначениеФиксированныйМассив = Новый ФиксированныйМассив(ЗначениеМассив);
	
	Ожидаем.Что(ПроверкаТипа.ЭтоМассив(ЗначениеМассив), "Проверка типа <Массив> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоФиксированныйМассив(ЗначениеФиксированныйМассив), "Проверка типа <ФиксированныйМассив> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоЛюбойМассив(ЗначениеМассив), "Проверка типа <Массив> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоЛюбойМассив(ЗначениеФиксированныйМассив), "Проверка типа <ФиксированныйМассив> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеМассив), "Проверка типа <Массив> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеФиксированныйМассив), "Проверка типа <ФиксированныйМассив> должна быть успешной").ЕстьИстина();
		
КонецПроцедуры

Процедура ТестДолжен_ПроверитьТаблицаЗначений() Экспорт

	ЗначениеТаблицаЗначений = Новый ТаблицаЗначений();
	
	Ожидаем.Что(ПроверкаТипа.ЭтоТаблицаЗначений(ЗначениеТаблицаЗначений), "Проверка <ЭтоТаблицаЗначений> типа <ТаблицаЗначений> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеТаблицаЗначений), "Проверка <ЭтоСсылочныйТип> типа <ТаблицаЗначений> должна быть успешной").ЕстьИстина();
		
КонецПроцедуры

Процедура ТестДолжен_ПроверитьДеревоЗначений() Экспорт

	ЗначениеПроверки = Новый ДеревоЗначений();
	
	Ожидаем.Что(ПроверкаТипа.ЭтоДеревоЗначений(ЗначениеПроверки), "Проверка <ЭтоДеревоЗначений> типа <ДеревоЗначений> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеПроверки), "Проверка <ЭтоСсылочныйТип> типа <ДеревоЗначений> должна быть успешной").ЕстьИстина();
		
КонецПроцедуры

Процедура ТестДолжен_ПроверитьСписокЗначений() Экспорт

	ЗначениеПроверки = Новый СписокЗначений();
	
	Ожидаем.Что(ПроверкаТипа.ЭтоСписокЗначений(ЗначениеПроверки), "Проверка <ЭтоСписокЗначений> типа <СписокЗначений> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеПроверки), "Проверка <ЭтоСсылочныйТип> типа <СписокЗначений> должна быть успешной").ЕстьИстина();
		
КонецПроцедуры

Процедура ТестДолжен_ПроверитьСтруктуры() Экспорт

	ЗначениеСтруктура = Новый Структура();
	ЗначениеФиксированныйСтруктура = Новый ФиксированнаяСтруктура(ЗначениеСтруктура);
	
	Ожидаем.Что(ПроверкаТипа.ЭтоСтруктура(ЗначениеСтруктура), "Проверка <ЭтоСтруктура> типа <Структура> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоФиксированнаяСтруктура(ЗначениеФиксированныйСтруктура), "Проверка <ЭтоФиксированнаяСтруктура> типа <ФиксированнаяСтруктура> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоЛюбаяСтруктура(ЗначениеСтруктура), "Проверка <ЭтоЛюбаяСтруктура> типа <Структура> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоЛюбаяСтруктура(ЗначениеФиксированныйСтруктура), "Проверка <ЭтоЛюбаяСтруктура> типа <ФиксированнаяСтруктура> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеСтруктура), "Проверка <ЭтоСсылочныйТип> типа <Структура> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеФиксированныйСтруктура), "Проверка <ЭтоСсылочныйТип> типа <ФиксированнаяСтруктура> должна быть успешной").ЕстьИстина();
		
КонецПроцедуры

Процедура ТестДолжен_ПроверитьСоответствия() Экспорт

	ЗначениеСоответствие = Новый Соответствие();
	ЗначениеФиксированноеСоответствие = Новый ФиксированноеСоответствие(ЗначениеСоответствие);
	
	Ожидаем.Что(ПроверкаТипа.ЭтоСоответствие(ЗначениеСоответствие), "Проверка <ЭтоСоответствиеЗначениеСоответствие> типа <Соответствие> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоФиксированноеСоответствие(ЗначениеФиксированноеСоответствие), "Проверка <ЭтоФиксированноеСоответствие> типа <ФиксированноеСоответствие> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоЛюбоеСоответствие(ЗначениеСоответствие), "Проверка <ЭтоЛюбоеСоответствие> типа <Соответствие> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоЛюбоеСоответствие(ЗначениеФиксированноеСоответствие), "Проверка <ЭтоЛюбоеСоответствие> типа <ФиксированноеСоответствие> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеСоответствие), "Проверка <ЭтоСсылочныйТип> типа <Соответствие> должна быть успешной").ЕстьИстина();
	Ожидаем.Что(ПроверкаТипа.ЭтоСсылочныйТип(ЗначениеФиксированноеСоответствие), "Проверка <ЭтоСсылочныйТип> типа <ФиксированноеСоответствие> должна быть успешной").ЕстьИстина();
		
КонецПроцедуры

#КонецОбласти

Лог = Логирование.ПолучитьЛог("oscript.lib.types.testing");



