

Перем Поле1 Экспорт;
Перем Поле2 Экспорт;

Процедура СкопироватьВ(Приемник, Знач РежимКопирования) Экспорт
	
	Приемник.Поле1 = КопированиеТипа.Скопировать(Поле1, , РежимКопирования);
	Приемник.Поле2 = КопированиеТипа.Скопировать(Поле2, , РежимКопирования);

КонецПроцедуры

Функция Скопировать(Знач РежимКопирования) Экспорт
	
	НовыйСценарий = Новый ТестовыйСценарий;

	НовыйСценарий.Поле1 = КопированиеТипа.Скопировать(Поле1, , РежимКопирования);
	НовыйСценарий.Поле2 = КопированиеТипа.Скопировать(Поле2, , РежимКопирования);

	Возврат НовыйСценарий;

КонецФункции
